---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures
source: html/306b7ebc-5d5e-e53f-d5e4-9a5da4162068.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures

Failures about DesignOptionFailures.

## Syntax (C#)
```csharp
public static class DesignOptionFailures
```